function ok=isEffective(A,W) %判断某个单元是否有效
L1=[A(1,1)-A(2,1),A(1,2)-A(2,2),A(1,3)-A(2,3)]; 
L2=[A(1,1)-A(3,1),A(1,2)-A(3,2),A(1,3)-A(3,3)]; %获得三角形单元两个边向量
n=cross(L1,L2);
n=n./sqrt(dot(n,n)); %叉乘得法向向量，再进行单位化
G1=(A(1,1)+A(2,1)+A(3,1))/3.0;
G2=(A(1,2)+A(2,2)+A(3,2))/3.0;
G3=(A(1,3)+A(2,3)+A(3,3))/3.0;  
G=[G1,G2,G3]; %取三个坐标的中心，作为中心点
R=W-G; 
R=R/sqrt(dot(R,R)); %入射点到单元中心的向量，并单位化
temp=dot(n,R); %得到入射向量与法向向量夹角
if(temp>0)
    ok=1;
    return;
end
if(temp<=0)
    ok=0;
    return;
end  %如果是-90~90度，则入射声波可以到达此单元，否则不能
